[
  {
    "id": 1,
    "title": "The Rise of Quality Footwear in Calicut’s Wholesale Market",
    "slug": "rise-of-quality-footwear-calicut",
    "date": "2025-02-10",
    "image": "/cutting.png",
    "excerpt": "Discover how Calicut has become a hub for quality footwear distribution and what this means for retailers across Kerala.",
    "content": "Over the past decade, Calicut has quietly transformed into one of South India's most vibrant wholesale footwear destinations. The combination of strategic port access, strong logistics, and evolving consumer demand has helped local distributors scale faster than ever before. MK Footwear has been at the forefront of this shift—bridging quality brands with retail businesses seeking consistency and trust. From locally-made sandals to national lifestyle brands, Calicut’s footwear market is setting new benchmarks in both design and distribution efficiency."
  },
  {
    "id": 2,
    "title": "Top 5 Footwear Trends Dominating Kerala in 2025",
    "slug": "top-footwear-trends-kerala-2025",
    "date": "2025-03-01",
    "image": "/kidssh.jpg",
    "excerpt": "2025 brings new footwear trends to Kerala — from sustainable soles to retro-inspired sneakers.",
    "content": "Fashion-forward customers in Kerala are embracing hybrid footwear styles—mixing comfort with contemporary design. Lightweight soles, breathable uppers, and locally inspired aesthetics are leading the charge. Sustainable production methods and customizable fits are also reshaping buying habits. At MK Footwear, we’ve curated collections from trusted brands like Paragon, Red Tape, and Campus that align with these trends, ensuring both style and durability."
  },
  {
    "id": 3,
    "title": "Why Retailers Choose MK Footwear for Their Inventory",
    "slug": "why-retailers-choose-mk-footwear",
    "date": "2025-01-28",
    "image": "/core.png",
    "excerpt": "Consistency, variety, and trust—three reasons hundreds of retailers across Kerala rely on MK Footwear.",
    "content": "Our strength lies in reliable supply, transparent pricing, and genuine brand partnerships. Retailers don’t just look for stock—they look for dependable relationships. MK Footwear bridges the gap between manufacturers and small-scale retailers with a model built on trust, timely delivery, and after-sales support."
  },
  {
    "id": 4,
    "title": "Sustainable Footwear: The Future of Wholesale in India",
    "slug": "sustainable-footwear-future-india",
    "date": "2025-04-05",
    "image": "/formals.png",
    "excerpt": "Eco-conscious production is shaping the next chapter of India’s footwear industry. Here’s how wholesalers can adapt.",
    "content": "The global shift toward sustainable materials has reached India’s footwear sector. With brands experimenting with recycled rubber, organic cotton, and biodegradable packaging, wholesalers like MK Footwear are helping retailers stock eco-friendly options. This not only reduces environmental impact but also attracts modern, mindful consumers."
  },
  {
    "id": 5,
    "title": "How Footwear Wholesalers Can Grow Their Online Presence",
    "slug": "footwear-wholesalers-online-growth",
    "date": "2025-05-16",
    "image": "/online.avif",
    "excerpt": "Digital visibility has become essential for wholesalers. Learn how social media and catalog optimization can increase reach.",
    "content": "Social platforms like Instagram and WhatsApp have turned into major touchpoints for B2B sales. MK Footwear uses digital catalogs, storytelling, and direct messaging to simplify communication. A strong online presence helps wholesalers reach beyond local markets and engage with retailers statewide."
  },
  {
    "id": 6,
    "title": "Inside Calicut’s Footwear Distribution Network",
    "slug": "inside-calicut-footwear-network",
    "date": "2025-06-10",
    "image": "/wholesale.jpg",
    "excerpt": "Take a behind-the-scenes look at how Calicut’s efficient supply network powers Kerala’s footwear retail industry.",
    "content": "Calicut’s network of importers, warehouses, and retailers forms one of the most efficient supply ecosystems in South India. MK Footwear’s partnerships with transporters and local distributors ensure that every product—from casuals to formal shoes—reaches stores quickly and in pristine condition. This agility gives Calicut a strong competitive edge in the footwear market."
  }
]
